ClarePhang/cc2650_easy_link_example_BEng_Final_Project/apps/cc13xx_easy_link_training/cc13xx_easy_link_rx.c
//******************************************************************************
//! @file       cc13xx_easy_link_rx.c
//! @brief      
//!
//! Revised     $Date:
//! Revision    $Revision:
//
//  Copyright (C) 2013 Texas Instruments Incorporated - http://www.ti.com/
//
//
//  Redistribution and use in source and binary forms, with or without
//  modification, are permitted provided that the following conditions
//  are met:
//
//    Redistributions of source code must retain the above copyright
//    notice, this list of conditions and the following disclaimer.
//
//    Redistributions in binary form must reproduce the above copyright
//    notice, this list of conditions and the following disclaimer in the
//    documentation and/or other materials provided with the distribution.
//
//    Neither the name of Texas Instruments Incorporated nor the names of
//    its contributors may be used to endorse or promote products derived
//    from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//*****************************************************************************/


/*******************************************************************************
* INCLUDES
*/
#include "stdlib.h"

// Synth calibration fix
#include "cc13xx_init_lib.h"

// BSP
#include "bsp.h"
#include "bsp_key.h"
#include "bsp_led.h"

// LCD
#include "lcd_dogm128_6.h"

// Chip specific
#include "prcm.h"
#include "cpu.h"
#include "interrupt.h"
#include "hw_ints.h"
#include "pwr_ctrl.h"
#include "rfc.h"

// RF Core
#include "common_cmd.h"
#include "prop_cmd.h"
#include "prop_mailbox.h"
#include "hw_rfc_dbell.h"
#include "hw_rfc_pwr.h"
#include "hw_adi_0_rf.h"
#include "radio_par.h"

// RF Core Patches
#define SYS_PATCH_TYPE static uint32_t
#include "apply_patch.h"
#include "apply_genfsk_rfe_patch.h"
#include "apply_genfsk_mce_patch.h"

// RF dataqueue headers
#include "data_entry.h"


/*******************************************************************************
* LOCAL FUNCTION PROTOTYPES
*/
static void appError(void);
static void appRfDataQueueAndAbortIsr(void);
static void appDisplayWelcomeScreen(void);
static void appInitializeLcd(void);
static void appUpdateRxScreen(uint32_t packetReceived);
static void appDcdcOn(uint8_t on);
static void applyPatches(void);


/*******************************************************************************
* DEFINES
*/
#define DATA_ENTRY_HEADER_SIZE 8 // Contant header size of a Generic Data Entry
#define MAX_LENGTH            20 // Max length byte the radio will accept 
                                             
#define DATA_ENTRY_DATA_SIZE (MAX_LENGTH + 2) // The Data Entries data field will contain:
                                              //   - the length indicator (optional)
                                              //   - the payload  
                                              //   - the appended meta-data, rssi etc. (optional)                        

/* Low power LCD mode configuration.
 *   This mode will not initialize the LCD until it has received a configurable amount of packets 
 *   with CRC valid. This will significantly lower the power consumption numbers when searching
 *   for sync and when receiving packets, up until the LCD is turned on. */
#define LOW_POWER_LCD_MODE 0
#define LOW_POWER_LCD_MODE_LCD_ON_PACKETS 500


/****** STEP 0 - Application Initialization *********************************
 *
 * (Outside main function)
 *
 * 1. Declare the RF specific variables.
 *      - These are the variables needed for interracting with the RF Core.
 *
 *      Note:
 *        - All RF Core command structures have to be 4 byte aligned.
 *
 * 2. Declare application specific variables. 
 *      - These are used to control the flow of the EasyLink application. 
 *
 * (Inside main function)
 *
 * 3. Initialize the board, buttons, SPI, LCD and print to LCD.
 * 4. Configure DCDC enable interrupt
 ***************************************************************************/

  /* 0.1. Declare the RF specific variables. */
  /* 0.1.1. All RF Core command structures and Data Entries have to be 4 byte aligned */
  #pragma data_alignment = 4
  static rfc_CMD_PROP_RADIO_SETUP_t propSetupCommand;
  #pragma data_alignment = 4
  static rfc_CMD_PROP_RX_t rxCommand;
  #pragma data_alignment = 4
  static rfc_CMD_FS_t fsCommand;
  #pragma data_alignment = 4
  static rfc_CMD_WRITE_RFREG_t writeRfRegCommand;
  
  #pragma data_alignment = 4
  static uint8_t rxDataEntry0Buffer[DATA_ENTRY_HEADER_SIZE + DATA_ENTRY_DATA_SIZE];
  #pragma data_alignment = 4
  static uint8_t rxDataEntry1Buffer[DATA_ENTRY_HEADER_SIZE + DATA_ENTRY_DATA_SIZE];
 
  /* 0.1.2. Non-aligned RF specific variables */
  static uint32_t propOverridesArray[32];
  static uint32_t* propOverrides = propOverridesArray;
  static rfc_propRxOutput_t rxStatistics;
  static uint32_t scaledFreq;
  static uint16_t realFrequency;
  static uint16_t realFractFreq;
  
  /* Data Entries used in RX */
  static rfc_dataEntry_t* dataEntry0 = (rfc_dataEntry_t*)&rxDataEntry0Buffer;
  static rfc_dataEntry_t* dataEntry1 = (rfc_dataEntry_t*)&rxDataEntry1Buffer;

  /* Receive dataQueue for RF Core to fill in data */
  static dataQueue_t dataQueue;
  
