ClarePhang/cc2650_easy_link_example_BEng_Final_Project/apps/cc13xx_easy_link_training/cc13xx_easy_link_rx.c
/*******************************************************************************
* @brief    PER test main function
*
* @return   None
*******************************************************************************/
main(void)
{  
  /* 0.3. Initialize the board, SPI, LCD and print to LCD.
   *        Note:
   *          - Only do this if we are not in low power LCD mode. If we are in that mode then the
   *            LCD will be initialized at a later stage. */
#if (LOW_POWER_LCD_MODE == 0)
  appInitializeLcd();
#endif
  
  /* 0.4. Configure DCDC and enable interrupt
   *        - Default is DCDC on. */
  appDcdcOn(true);
  IntMasterEnable();
  
  
 
  /****** STEP 1 - RF Core Prerequisites **************************************
   * 1. Switch to HF crystal
   * 2. Enable RF Core power
   * 3. Enable RF Core clocks
   * 4. Send a Ping command to RF Core
   * 5. Wait for Ping response
   ***************************************************************************/
  
  /* 1.1. Switch to external high-speed XTAL. */
  /* Enable OSC DIG interface to change clock sources */
  OSCInterfaceEnable();
  /* Check to not enable XOSC if already enabled */
  if(OSCClockSourceGet(OSC_SRC_CLK_HF) != OSC_XOSC_HF)
  {
    /* Request to switch to the crystal to enable radio operation. */
    OSCClockSourceSet(OSC_SRC_CLK_LF | OSC_SRC_CLK_MF | OSC_SRC_CLK_HF,
                      OSC_XOSC_HF);
    /* Switch the HF source to XTAL - Done via ROM API*/
    OSCHfSourceSwitch();
  }
  /* Disable OSC DIG interface */
  OSCInterfaceDisable();
  
  /* 1.2. Enable RF Core power domain and wait until it's on */
  PRCMPowerDomainOn(PRCM_DOMAIN_RFCORE);
  while(PRCMPowerDomainStatus(PRCM_DOMAIN_RFCORE) != PRCM_DOMAIN_POWER_ON);

  /* 1.3. Enable clocks inside RF Core */
  RFCClockEnable();
  while (HWREG(RFC_PWR_NONBUF_BASE + RFC_PWR_O_PWMCLKEN) != 0x7FF);
  
  /* 1.4. Ping RF Core */
  HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDR) = CMDR_DIR_CMD(CMD_PING);
  
  /* 1.5. Wait for Ping done */
  while( HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDSTA) == CMDSTA_Pending);
  if( HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDSTA) != CMDSTA_Done )
    appError();  
  
  
  
  /****** STEP 2 - Setup radio ************************************************
   * 1. Patch RF Core with latest patches
   * 2. Create CMD_PROP_RADIO_SETUP command
   *
   *      Parameter configuration:
   *        - Please see the Proprietary Mode documentation, "cc26xx_pg1_prop_rf_fw_spec".
   *          Also see the "cc26xx_pg1_rfcore_hal" for the command header configuartion.
   *
   *      Overrides:
   *        - Low-level overrides is used in PG1 to indicate that we want to run the 
   *          radio from patch RAM and that we want to program the freq. synth. from
   *          the CM3, instead of CM0. Also configure internal bias and high-impedance 
   *          on RXTX pin.
   *
   * 3. Send CMD_PROP_RADIO_SETUP command
   * 4. Wait until command is done executing
   ***************************************************************************/
  
  /* 2.1. Patch the RF Core */
  applyPatches();
  
  /* 2.2.1 Create CMD_PROP_RADIO_SETUP command */
  /* Command header configuration */
  propSetupCommand.commandNo                = CMD_PROP_RADIO_SETUP;
  propSetupCommand.status                   = IDLE;
  propSetupCommand.pNextOp                  = NULL;
  propSetupCommand.startTime                = 0;
  propSetupCommand.startTrigger.triggerType = TRIG_NOW;
  propSetupCommand.condition.rule           = COND_NEVER;
  
  /* Command specific configuration */
  propSetupCommand.modulation.modType       = 0;                  // FSK
  propSetupCommand.modulation.deviation     = 25 * (4 * 6/2);     // 25 kHz deviation (see docs)
  propSetupCommand.symbolRate.rateWord      = 25165;              // 38.4 ksps (38.399)
  propSetupCommand.symbolRate.preScale      = 15;
  propSetupCommand.symbolRate.bNoFsPowerUp  = 0;                  // Power up freq. synth.
  propSetupCommand.rxBw                     = 2;                  // 110 kHz RX bandwidth
  propSetupCommand.preamConf.nPreamBytes    = 5;                  // 5 bytes preamble
  propSetupCommand.preamConf.preamMode      = 1;                  // Send 1 as first bit
  propSetupCommand.formatConf.nSwBits       = 32;                 // 32 bits sync word
  propSetupCommand.formatConf.bBitReversal  = 0;                  // Positive deviation for '1'
  propSetupCommand.formatConf.bMsbFirst     = 1;                  // Send MSB first
  propSetupCommand.formatConf.whitenMode    = 0;                  // No whitening
  
  /* 2.2.2 Create low-level overrides and add them to the setup command */
  *propOverrides++ = MCE_RFE_OVERRIDE(1, 0, 0, 1, 0, 0); // Run modem patches
  *propOverrides++ =                                     // (PG1 only) Control freq. synth. from CM3
    SW_REG_OVERRIDE(synthPar, config, ((1 << 7) | 1));
  
  /* Configure internal bias and high-impedance on RXTX pin */
  uint32_t lna2Val = ((1 << ADI_0_RF_LNACTL2_RXTX_PIN_S) | (0 << ADI_0_RF_LNACTL2_EXT_BIAS_S));
  *propOverrides++ = ADI_HALFREG_OVERRIDE(0, ADI_0_RF_O_LNACTL2 * 2 + 1, 0xD, (lna2Val >> 4));

  *propOverrides++ = END_OVERRIDE;
  propSetupCommand.pRegOverride = propOverridesArray;
  
  /* 2.3. Send CMD_PROP_RADIO_SETUP command to RF Core */
  HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDR) = (uint32_t)&propSetupCommand;
  
  /* 2.4. Wait until command finished executing */
  /* 2.4.1 First wait until received, parsed and running on RF Core */
  while( HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDSTA) == CMDSTA_Pending);
  if( HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDSTA) != CMDSTA_Done )
    appError();  
  
  /* 2.4.2 Wait until command is done executing */
  while( (propSetupCommand.status & 0x0F00) != DONE_OK );
  
  
  
  /****** STEP 3 - Set frequency **********************************************
   * 1. Create CMD_FS command
   * 2. Send CMD_FS command
   * 3. Wait until command is done executing
   * 4. (PG1 only) Configure freq. synth. from CM3
   ***************************************************************************/
  
