ClarePhang/cc2650_easy_link_example_BEng_Final_Project/apps/cc13xx_easy_link_training/cc13xx_easy_link_rx.c
  /* 3.1.1 Create CMD_FS command */
  /* Command header configuration */
  fsCommand.commandNo = CMD_FS;
  fsCommand.status = IDLE;
  fsCommand.pNextOp = NULL;
  fsCommand.startTime = 0;
  fsCommand.startTrigger.triggerType = TRIG_NOW;
  fsCommand.condition.rule = COND_NEVER;
  
  /* Command specific configuration */
  fsCommand.frequency                   = 868;  // Whole frequency setting
  fsCommand.fractFreq                   = 0;    // Fractional frequency setting
  fsCommand.synthConf.divider           = 6;    // Divider depends on frequency band
  fsCommand.synthConf.bTxMode           = 0;    // Set freq. synth. in TX mode
  fsCommand.calibConf.bOverrideCalib    = 0;    // Configure no form of calibration
  fsCommand.calibConf.bSkipTdcCalib     = 0;    // (Done in CM3 in PG1)
  fsCommand.calibConf.bSkipCoarseCalib  = 0;
  fsCommand.calibConf.bSkipMidCalib     = 0;
  fsCommand.coarsePrecal                = 0;
  fsCommand.midPrecal                   = 0;
  fsCommand.tdcPrecal                   = 0;
  
  /* 3.1.2 (PG1 only) Rescale the frequency based on divider */
  realFrequency = fsCommand.frequency;
  realFractFreq = fsCommand.fractFreq;
  scaledFreq = (((fsCommand.frequency << 16) | fsCommand.fractFreq) *2/fsCommand.synthConf.divider);
  fsCommand.frequency = (scaledFreq >> 16);
  fsCommand.fractFreq = (scaledFreq & 0xFFFF);
  

  /* 3.2. Send CMD_FS command to RF Core */
  HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDR) = (uint32_t)&fsCommand;
  
  /* 3.3. Wait until command finished executing */
  /* 3.3.1. First wait until received, parsed and running on RF Core */
  while( HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDSTA) == CMDSTA_Pending);
  if( HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDSTA) != CMDSTA_Done )
    appError();  
  
  /* 3.3.2. Wait until command is done executing */
  while( (fsCommand.status & 0x0F00) != DONE_OK );
  
  /* 3.4. (PG1 only) Configure freq. synth. from CM3 */
  InitLib_startAndCalibrateSynth(((realFrequency << 16) | (realFractFreq)), 
                                 fsCommand.synthConf.divider,
                                 InitLibRadioMode_GenFsk,
                                 InitLibSynthMode_RX,
                                 24);
  
  
  
  /****** STEP 3 - Prepare Data Entries ***************************************
   * 1. Create the two data entries
   * 
   *   Data Entity header: 
   *     - Status of entry:
   *       - 0: Pending
   *       - 1: Active
   *       - 2: Busy
   *       - 3: Finished
   *       - 4: Unfinished
   *
   * 2. Link the data entries togther in a circular buffer fashion
   * 3. Create Data Entry Queue and configure for circular buffer Data Entries
   * 4. Set read pointer to first entry
   ***************************************************************************/
  
  /* 3.1. Set the Data Entries common configuration */
  dataEntry0->status        = 0;                     // Pending - starting state
  dataEntry0->config.type   = 0;                     // General Data Entry
  dataEntry0->config.lenSz  = 0;                     // No length indicator byte in data
  dataEntry0->length        = DATA_ENTRY_DATA_SIZE;  // Total length of data field

  dataEntry1->status        = 0;                     // Pending - starting state
  dataEntry1->config.type   = 0;                     // General Data Entry
  dataEntry1->config.lenSz  = 0;                     // No length indicator byte in data
  dataEntry1->length        = DATA_ENTRY_DATA_SIZE;  // Total length of data field
  
  /* 3.2. Link the data entries togther in a circular buffer fashion */
  dataEntry0->pNextEntry = (uint8_t*)dataEntry1;
  dataEntry1->pNextEntry = (uint8_t*)dataEntry0;
  
  /* 3.3. Create Data Entry Queue and configure for circular buffer Data Entries */
  dataQueue.pCurrEntry = (uint8_t*)dataEntry0;
  dataQueue.pLastEntry = NULL;

  /* 3.4. Set read pointer to first entry */
  readEntry = dataEntry0;

  

  /****** STEP 4 - RX *********************************************************
   * 1. Create CMD_PROP_RX command
   * 2. Setup interrupt on RX_ENTRY_DONE
   * 3. Send CMD_PROP_RX command
   * 4. Wait until command submitted ok
   ***************************************************************************/
  
  /* 4.1. Create CMD_PROP_RX command */
  /* Command header configuration */
  rxCommand.commandNo                = CMD_PROP_RX;
  rxCommand.status                   = IDLE;
  rxCommand.pNextOp                  = NULL;
  rxCommand.startTime                = 0;
  rxCommand.startTrigger.triggerType = TRIG_NOW;
  rxCommand.condition.rule           = COND_NEVER;
  
  /* Command specific configuration */
  rxCommand.pktConf.bFsOff           = 0;           // Keep frequency synth on after RX done
  rxCommand.pktConf.bRepeat          = 1;           // Go back into RX after RX done
  rxCommand.pktConf.bUseCrc          = 1;           // Use CRC
  rxCommand.pktConf.bVarLen          = 1;           // Expect variable length
  rxCommand.syncWord                 = 0x930B51DE;  // Sync word to listen for
  rxCommand.maxPktLen                = MAX_LENGTH;  // Max packet length to receive
  rxCommand.endTrigger.triggerType   = TRIG_NEVER;  // Never leave RX
  
  rxCommand.rxConf.bIncludeHdr       = 1;           // Include the length byte
  rxCommand.rxConf.bAppendRssi       = 0;           // Do not append RSSI
  rxCommand.rxConf.bAppendStatus     = 1;           // Append status byte
  rxCommand.pQueue                   = &dataQueue;  // Set the Data Entity queue for received data
  rxCommand.pOutput                  = (uint8_t*)&rxStatistics; // Set rx statistics output struct
  
  /* 4.2. Setup interrupt on RX_ENTRY_DONE and RX_ABORTED */
  IntMasterDisable();
  
  /* Multiplex all RF Core interrupts to CPE0 IRQ and enable the following interrupts: 
   *   - IRQ_PROP_RX_ENTRY_DONE - RX queue data entry changing state to finished 
   *   - IRQ_PROP_RX_ABORTED - abort */
  HWREG( RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEISL ) = 0;
  HWREG( RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIEN ) = IRQ_PROP_RX_ENTRY_DONE | IRQ_PROP_RX_ABORTED;
 
  /* Clear any pending interrupts, register interrupts handler and enable interrupts. */
  HWREG( RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIFG ) = 0x0;
  IntPendClear(INT_RF_CPE0);
  IntRegister(INT_RF_CPE0, &appRfDataQueueAndAbortIsr);
  IntEnable(INT_RF_CPE0);
  IntMasterEnable();
  
