ClarePhang/cc2650_easy_link_example_BEng_Final_Project/apps/cc13xx_easy_link_training/cc13xx_easy_link_rx.c
  /* 4.3. Send CMD_PROP_RX command to RF Core */
  HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDR) = (uint32_t)&rxCommand;
  
  /* 4.4. Wait until command submited ok */
  while( HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDSTA) == CMDSTA_Pending);
  if( HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDSTA) != CMDSTA_Done )
    appError();  
 
  /* Enter main, infinite, loop */
  while(true)
  {
    /* Power off as many power domain as possible */
    PRCMPowerDomainOff(domainsToPowerOff);
    
    /* Enter deep-sleep while waiting for packets */
    PRCMDeepSleep();
      
    /* Packet received? */
    if (received)
    {
      received = false;

      appUpdateRxScreen(packetReceived);
    }
  }
}


/*******************************************************************************
* @brief    Patches the RF Core firmware
*
*           Patches the CPE as well as the modem and front-end.
*
*           Note: This should be done after a command has been succesfully sent to the RF Core
*                 so that it is guaranteed to happen after the radio has done its own 
*                 initialization.
* 
* @return   None
*******************************************************************************/
static void applyPatches(void)
{
  /* Apply CPE patch.
   * Note: The below line will be included in a future CPE patch. */
  *((uint32_t *)0x21000028) = 0x00000000;
  applyPatch();
  
  /* Start RAT timer */
  HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDR) = CMDR_DIR_CMD(CMD_START_RAT);
  
  /* Wait until done (because this is a direct command) */
  while( HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDSTA) == CMDSTA_Pending);
  if( HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDSTA) != CMDSTA_Done )
    appError();  
  
  /* Force-enable the MCE and RFE RAM, used for patching */
  HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDR) 
    = CMDR_DIR_CMD_2BYTE(CMD_FORCE_CLK_ENA, RFC_PWR_PWMCLKEN_MDMRAM | 
                                            RFC_PWR_PWMCLKEN_RFERAM);
  
  /* Wait until done (because this is a direct command) */
  while( HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDSTA) == CMDSTA_Pending);
  if( HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDSTA) != CMDSTA_Done )
    appError();  
  
  /* Apply the RFE and MCE patch to the respective patch RAM */
  enterGenfskRfePatch();
  enterGenfskMcePatch();

  /* Remove force-enable of the MCE and RFE RAM clocks */
  HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDR) = CMDR_DIR_CMD_2BYTE(CMD_FORCE_CLK_ENA, 0);
  
  /* Wait until done (because this is a direct command) */
  while( HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDSTA) == CMDSTA_Pending);
  if( HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDSTA) != CMDSTA_Done )
    appError();
  
  /* Force BUS power domain on from RF Core
   *   Note:
   *     This has to be on for the RF Core to be able to access the patches via the system bus. */
  writeRfRegCommand.commandNo = CMD_WRITE_RFREG;
  writeRfRegCommand.address   = 0x1128;
  writeRfRegCommand.value     = 2;
  
  HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDR) = (uint32_t)&writeRfRegCommand;
  
  /* Wait until done (because this is a immediate command) */
  while( HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDSTA) == CMDSTA_Pending);
  if( HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDSTA) != CMDSTA_Done )
    appError();
}

/*******************************************************************************
* @brief    Update RX screen
@
@ param     packetReceived - Number of packets received       
*
* @return   None
*******************************************************************************/
static void appUpdateRxScreen(uint32_t packetReceived)
{
#if ((LOW_POWER_LCD_MODE == 1))
  if(packetReceived < LOW_POWER_LCD_MODE_LCD_ON_PACKETS || (LOW_POWER_LCD_MODE_LCD_ON_PACKETS == 0))
    return;
  else
  {
    if(!lowPowerLcdOn)
    {
      lowPowerLcdOn = true;
      appInitializeLcd();
    }
  }
#endif
  
  lcdBufferClear(0);
  lcdBufferPrintString(0, "Packets", 63, eLcdPage1);
  lcdBufferPrintString(0, "Received:", 63, eLcdPage2);
  lcdBufferPrintInt(0, packetReceived, 63, eLcdPage4);
  lcdSendBufferPart(0, 63, 127, eLcdPage1, eLcdPage6);
}

/*******************************************************************************
* @brief    Initialize LCD
@
@ param     
*
* @return   None
*******************************************************************************/
static void appInitializeLcd(void)
{
  /* Do not power off the power domains needed for the LCD */
  domainsToPowerOff &= ~(PRCM_DOMAIN_PERIPH | PRCM_DOMAIN_SERIAL);
  
  PRCMPowerDomainOn( PRCM_DOMAIN_PERIPH | PRCM_DOMAIN_SERIAL);
  while(PRCMPowerDomainStatus(PRCM_DOMAIN_PERIPH | PRCM_DOMAIN_SERIAL) == PRCM_DOMAIN_POWER_OFF);
  
  bspInit(BSP_SYS_CLK_SPD);
  bspSpiInit(BSP_SPI_CLK_SPD);
  lcdInit();
  appDisplayWelcomeScreen();
}

/*******************************************************************************
* @brief    Display welcome screen
* 
*           
*
* @return   None
*******************************************************************************/
static void appDisplayWelcomeScreen(void)
{
  lcdClear();
  lcdBufferClear(0);
  lcdSendBuffer(pLcdTiLogo);
  lcdBufferPrintString(0, "CC13xx", 63, eLcdPage2);
  lcdBufferPrintString(0, "RX Test", 63, eLcdPage3);
  lcdBufferPrintString(0, "Waiting to", 63, eLcdPage5);
  lcdBufferPrintString(0, "receive...", 63, eLcdPage6);
  lcdSendBufferPart(0, 63, 127, eLcdPage2, eLcdPage6);
}

/*******************************************************************************
* @brief    CPE0 interrupt callback, to be used with CPE interrupt 19 and 21
*           (Packet reception stopped before packet was done (19) and
*           dataEntry element status set to Finished (21))
*           
*           The function assumes the following settings:
*           genFskConfig->pktConfUseCrc   = 1
*           genFskConfig->pktConfVarLen   = 1
*           genFskConfig->rxConfIncludeHdr = 1
*           genFskConfig->rxConfAppendRssi = 0
*           genFskConfig->rxConfAppendStatus = 1
*
* @return   None
*******************************************************************************/
static void appRfDataQueueAndAbortIsr(void)
{
  //\* Start critical section */
  IntMasterDisable();
    
  if ((HWREG( RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIFG)) & IRQ_PROP_RX_ENTRY_DONE)
  {  
    bool crcOk = 0;
    uint8_t status = 0;
    uint8_t length = 0;
    
    /* Loop through status of received packets, start at preadEntry
      Continue as long as hitting elements with Finished status */
    while(GET_FIELD_V(readEntry, dataEntry, status) == DATA_ENTRY_FINISHED)
    {
      length = readEntry->data;
      
      /* Read out package status
        (bit 7 and 6 are result)
        result	00: Packet received correctly, not ignored
               01: Packet received with CRC error
               10: Packet received correctly, but can be ignored
               11: Packet reception was aborted */
      status  = *(uint8_t*)(&readEntry->data + length + 1);
      crcOk   = (status & 0xC0) == 0x00 ? 1 : 0;

      /* Only add received package to receive buffer if CRC is OK */
      if(crcOk)
      {
        /* Set packet received flag and increment packets received */
        received = true;
        packetReceived++;
      } 
      
      /* Set status to pending */
      GET_FIELD_V(readEntry, dataEntry, status) = DATA_ENTRY_PENDING;
  
      /* Move read entry pointer to next entry */
      readEntry = (rfc_dataEntry_t*)readEntry->pNextEntry;
    }
  }
   
  /*  Clear interrupt */
  HWREG( RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIFG ) = 0x0;

  /* End critical section */
  IntMasterEnable();
}


/*******************************************************************************
* @brief    Toggles DC/DC converter on/off
*
* @return   None
*******************************************************************************/
void appDcdcOn(uint8_t on)
{
  if(on)
  {
    PowerCtrlSourceSet(PWRCTRL_PWRSRC_DCDC);
  }
  else
  {
    PowerCtrlSourceSet(PWRCTRL_PWRSRC_GLDO);
  }
}


/*******************************************************************************
* @brief    Error function. Eternal loop that blinks all LEDs quickly.
*           Function assumes LEDs to be initialized by, for example, bspInit()
*
* @return   None
*******************************************************************************/
void appError(void)
{
  uint32_t ui32Delay = 1000000UL;
  bspLedClear(BSP_LED_ALL);

  while(true)
  {
    CPUdelay(ui32Delay);
    bspLedToggle(BSP_LED_ALL);
  }
}
